# Задача 2
# Найдите сумму цифр трехзначного числа.
# Пример:
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

number = int(input("введите ваше число: "))
n1= number  % 10
n2 = number // 100
n3 = (number // 10) % 10
print(n1 + n2 + n3)